---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.Rounding
source: html/3ccbda07-3d25-cfaa-3098-90cdd283fe97.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayVectorSettings.Rounding Property

Increment to which numeric values of analysis results are rounded in vectors.

## Syntax (C#)
```csharp
public double Rounding { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentsInconsistentException** - When setting this property: rounding is not positive